<a href="https://colab.research.google.com/github/codewithswatiee/DS-AI-ML/blob/main/SQLite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import sqlite3

In [11]:
## Connect to an SQLite db
connection = sqlite3.connect('test.db')
connection

In [12]:
cursor= connection.cursor()
cursor

In [14]:
##Create a table
cursor.execute('''
    Create Table If Not Exists employees(
      id Integer Primary Key,
      name Text not null,
      age Integer not null,
      department Text,
      salary Integer not null
    )
''')

## Commit the changes
connection.commit()

In [15]:
cursor.execute('''
  Select * from employees
''')

In [16]:
### Inserting data
cursor.execute('''
  Insert Into employees(name, age, department, salary)
  values('John', 23, 'DS', 45000)
''')

cursor.execute('''
  Insert Into employees(name, age, department, salary)
  values('Dow', 43, 'CS', 145000)
''')

cursor.execute('''
  Insert Into employees(name, age, department, salary)
  values('Johnny', 35, 'EXTC', 35000)
''')


## Commit
connection.commit()

In [18]:
## Querying the data
cursor.execute('''
  Select * from employees
''')

rows = cursor.fetchall()


#printing the queried data
for row in rows:
  print(row)

(1, 'John', 23, 'DS', 45000)
(2, 'Dow', 43, 'CS', 145000)
(3, 'Johnny', 35, 'EXTC', 35000)

In [19]:
## Updating the data
cursor.execute('''
  UPDATE employees
  Set age = 34
  where name='John'
''')

connection.commit()

In [20]:
## Querying the data
cursor.execute('''
  Select * from employees
''')

rows = cursor.fetchall()


#printing the queried data
for row in rows:
  print(row)

(1, 'John', 34, 'DS', 45000)
(2, 'Dow', 43, 'CS', 145000)
(3, 'Johnny', 35, 'EXTC', 35000)

In [21]:
## Delete the data from table
cursor.execute('''
  Delete from employees
  where name='Johnny'
''')

connection.commit()

In [22]:
## Querying the data
cursor.execute('''
  Select * from employees
''')

rows = cursor.fetchall()


#printing the queried data
for row in rows:
  print(row)

(1, 'John', 34, 'DS', 45000)
(2, 'Dow', 43, 'CS', 145000)

In [24]:
## Working with Sales Data

connection = sqlite3.connect('sales.db')
cursor = connection.cursor()

cursor.execute('''
  CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    product_name TEXT NOT NULL,
    price REAL NOT NULL,
    quantity INTEGER NOT NULL,
    total_amount REAL NOT NULL
  )
''')


sales_data = [
    ('Product A', 10.99, 5, 54.95),
    ('Product B', 19.99, 3, 59.97),
    ('Product C', 5.49, 20, 109.80),
    ('Product D', 7.99, 12, 95.88),
    ('Product E', 9.22, 23, 34.67)
]

cursor.executemany('''
  INSERT INTO sales(product_name, price, quantity, total_amount)
  VALUES(?, ?, ?, ?)
''', sales_data)

connection.commit()

In [25]:
cursor.execute('''
  SELECT * FROM sales
''')

rows = cursor.fetchall()

for row in rows:
  print(row)

(1, 'Product A', 10.99, 5, 54.95)
(2, 'Product B', 19.99, 3, 59.97)
(3, 'Product C', 5.49, 20, 109.8)
(4, 'Product D', 7.99, 12, 95.88)
(5, 'Product E', 9.22, 23, 34.67)

In [26]:
connection.close()